* compute cross.csv
#+begin_src python :var data="../../downloads/results.csv" renaming=renaming :results output raw
<<imports>>
d = pd.read_csv(data)[['benchmark', 'solver', 'configuration', 'time', 'status']]
d.loc[d['status'] != 'complete', 'time'] = 10000 # PAR-2
# d = d[d['benchmark'].map(lambda x: "new/SAT" in x or  "new/UNSAT" in x)] # planning only
g = d[['benchmark', 'status']]
g['s'] = g['status'] == 'complete'
g = g.groupby('benchmark').sum()['s']
p("Not solved " + str(len(g[g == 0])))
# d = d[d['benchmark'].map(lambda x: "new/abw" in x)]
d['n'] = d.apply(lambda x: x['solver'] + ("" if x['configuration'] == 'default' else '_' + str(x['configuration'])), axis=1)
d = d.merge(g, on='benchmark')
d = d[d['s'] > 0] # filter unsolevd by all
d = d[['n', 'benchmark', 'time']]

def sim(a, b):
  r = 0
  n = len(a)
  for x,y in zip(a,b):
    r += abs(x-y)
  return 1 - (r / (10000 * n))
  # for x,y in zip(a,b): # spearman
    # r += (x-y)**2
  # r *= 6
  # r /= n * ((n**2) - 1)
  # return 1 - r

s = {}
for n, b, t in d.values.tolist():
  if n not in s:
    s[n] = [(b,t)]
  else:
    s[n].append((b,t))
# for o in s: # spearman
  # s[o] = sorted(s[o], key=lambda x: x[1])
  # for i in range(len(s[o])):
    # s[o][i] = (s[o][i][0], i)

l = []
names = []
# for n in s: # print PAR-2
#   p("|" + n + "|" + str(sum([t for _,t in sorted(s[n])])))
for o, n, _ in renaming:
  l.append([t for _,t in sorted(s[o])])
  names.append(n)
m = [[0 for _ in range(len(l))] for _ in range(len(l))]
for i in range(len(l)):
  for j in range(len(l)):
    m[i][j] = sim(l[i], l[j])
d = pd.DataFrame(m)
d.columns = names
d.insert(0, 'with', '')
d['with'] = names
d = d.set_index('with')
d.to_csv('cross.csv')
#+end_src

#+RESULTS:
Not solved 186

